#include "sg90.h"

/*******************************************************************************
 * 函 数 名			: SG90_Initialize
 * 函数功能			: 初始化 SG90
 * 注意事项			: 无
 *******************************************************************************/
void SG90_Initialize(){
	TIM3_PWM_Init(19999 , 71 );
}

/*******************************************************************************
 * 函 数 名			: SG90_toRadianDegree
 * 函数功能			: 操纵 PWM 使 SG90 旋转到对应角度
 * @params	Radian	: 角度制角度
 * 注意事项			: 对应 -180 度到 180 度
 *******************************************************************************/
void SG90_toRadianDegree(int Radian){
	unsigned dutyCycle = 0;
	dutyCycle = 1500 + Radian * 1000 / 180;

	TIM_SetCompare2(TIM3, dutyCycle);
}
